# 主界面
def home_page():
    print("*********学生管理系统*********")
    print("*       1.教师登录/登出      *")
    print("*       2.学生信息录入       *")
    print("*       3.学生信息查询       *")
    print("*      4.学生信息修改/删除    *")
    print("*          0.退出           *")
    print("****************************")


def login_page():
    print("*********教师登录界面*********")
    print("*         1.登录           *")
    print("*         2.登出           *")
    print("*         3.注册           *")
    print("*       4.删除用户          *")
    print("*         0.返回           *")
    print("****************************")


def info_page():
    print("*********信息查询界面*********")
    print("*        1.全部输出         *")
    print("*        2.学号查询         *")
    print("*         0.返回           *")
    print("***************************")


def revise_page():
    print("*********信息删改界面*********")
    print("*        1.修改信息         *")
    print("*        2.删除信息         *")
    print("*         0.返回           *")
    print("***************************")
